Documents/ПереносРезервовМеждуСтатьямиФинансирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПереносРезервовМеждуСтатьямиФинансирования</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОценочныеОбязательства</xr:Item>
				<xr:Item>AccumulationRegister.ОценочныеОбязательстваПоСотрудникам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Резервы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяФинансированияИсточник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>Краткий перечень сотрудников, включенных в документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОценочныеОбязательстваПоСотрудникам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРезерва</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРезерваНУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРезерваСтраховыхВзносов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРезерваСтраховыхВзносовНУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРезерваФССНесчастныеСлучаи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРезерваФССНесчастныеСлучаиНУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтатьиФинансирования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяФинансирования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентРаспределения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОценочныеОбязательстваПоСотрудникам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ОценочныеОбязательстваПоСотрудникам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаРезерва</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРезерваСтраховыхВзносов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРезерваФССНесчастныеСлучаи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРезерваНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРезерваСтраховыхВзносовНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРезерваФССНесчастныеСлучаиНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Резервы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ПереносРезервовМеждуСтатьямиФинансирования/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок( ЗначениеРазрешено(ФизическиеЛица.ФизическоеЛицо, NULL КАК ИСТИНА)
	|	) И ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки);
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
КонецПроцедуры

#КонецОбласти

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
Функция ОписаниеСоставаОбъекта() Экспорт
	
	МетаданныеДокумента = Метаданные.Документы.ПереносРезервовМеждуСтатьямиФинансирования;
	ОписаниеСостава = ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаПоМетаданнымФизическиеЛицаВТабличныхЧастях(МетаданныеДокумента);
	Для Каждого ОписаниеЗаполнения Из ОписаниеСостава.ОписаниеХраненияСотрудниковФизическихЛиц Цикл
		ОписаниеЗаполнения.ВключатьВКраткийСостав = Истина;
	КонецЦикла;
	
	Возврат ОписаниеСостава;
	
КонецФункции

// Перезаполняет (и пересчитывает) данные формы документа-начисления 
// по переданным сотрудникам.
//
// Параметры:
//	Форма
//	ОписаниеДокумента - структура, описывающая документ-начисление 
//		(см. ОписаниеДокумента).
//	Сотрудники - ссылка или массив ссылок на сотрудников.
//	ИспользоватьДлительнуюОперацию.
//
Функция ПерезаполнитьДанныеФормы(Форма, Знач Сотрудники = Неопределено, ИспользоватьДлительнуюОперацию = Ложь) Экспорт
	
	СтруктураПараметров = ОписаниеДокумента();
	ЗаполнитьЗначенияСвойств(СтруктураПараметров, Форма.Объект);
	СтруктураПараметров.Вставить("Сотрудники", Сотрудники);
	
	Если Не ИспользоватьДлительнуюОперацию Тогда
		АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, Форма.УникальныйИдентификатор);
		ПодготовитьДанныеДляПерезаполнения(СтруктураПараметров, АдресХранилища);
		Возврат Новый Структура("ЗаданиеВыполнено, АдресХранилища", Истина, АдресХранилища);
	КонецЕсли;
	
	НаименованиеЗадания = НСтр("ru = 'Заполнение документа ""Перенос резервов между статьями финансирования""'");
	Результат = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
		Форма.УникальныйИдентификатор,
		"Документы.ПереносРезервовМеждуСтатьямиФинансирования.ПодготовитьДанныеДляПерезаполнения",
		СтруктураПараметров,
		НаименованиеЗадания);
	
	Возврат Результат;
	
КонецФункции

Процедура ПодготовитьДанныеДляПерезаполнения(СтруктураПараметров, АдресХранилища) Экспорт
	
	Сотрудники = СтруктураПараметров.Сотрудники;
	ПериодРегистрации = СтруктураПараметров.ПериодРегистрации;
	Организация = СтруктураПараметров.Организация;
	Подразделение = СтруктураПараметров.Подразделение;
	Резерв = СтруктураПараметров.Резерв;
	СтатьяФинансированияИсточник = СтруктураПараметров.СтатьяФинансированияИсточник;
	
	Если Сотрудники = Неопределено Тогда
		Если ЗначениеЗаполнено(Подразделение) Тогда
			Сотрудники = СотрудникиПоШапкеДокумента(СтруктураПараметров);
		КонецЕсли;
	КонецЕсли;
	
	СтруктураПараметров.Сотрудники = Сотрудники;
	ДанныеЗаполнения = РезервыСотрудников(СтруктураПараметров);
	
	РезультатЗаполнения = Новый Структура;
	РезультатЗаполнения.Вставить("ОценочныеОбязательстваПоСотрудникам", ДанныеЗаполнения);
	
	ПоместитьВоВременноеХранилище(РезультатЗаполнения, АдресХранилища);
	
КонецПроцедуры

Функция ОписаниеДокумента() Экспорт
	
	ОписаниеДокумента = Новый Структура("ПериодРегистрации, Организация, Подразделение,
		|Резерв, СтатьяФинансированияИсточник, Ссылка, Сотрудники");
	
	Возврат ОписаниеДокумента;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция АдресПараметровВХранилище(Объект, ДополнительныеПараметры) Экспорт
	
	ПараметрыДокумента = Новый Структура;
	ПараметрыДокумента.Вставить("СериализованныйОбъект", ЗарплатаКадры.СериализоватьОбъектВДвоичныеДанные(Объект));
	
	Возврат ПоместитьВоВременноеХранилище(ПараметрыДокумента, ДополнительныеПараметры.УникальныйИдентификатор);
	
КонецФункции

Процедура ПодготовитьДанныеДляОтраженияВУчете(ДокументСсылка, ДанныеДляОтражения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПереносРезервовМеждуСтатьямиФинансирования.Организация КАК Организация,
	|	ПереносРезервовМеждуСтатьямиФинансирования.Резерв КАК Резерв,
	|	ПереносРезервовМеждуСтатьямиФинансирования.Ссылка КАК Ссылка,
	|	ПереносРезервовМеждуСтатьямиФинансирования.СтатьяФинансированияИсточник КАК СтатьяФинансирования
	|ПОМЕСТИТЬ ВТ_ОписаниеДокумента
	|ИЗ
	|	Документ.ПереносРезервовМеждуСтатьямиФинансирования КАК ПереносРезервовМеждуСтатьямиФинансирования
	|ГДЕ
	|	ПереносРезервовМеждуСтатьямиФинансирования.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОписаниеДокумента.Организация КАК Организация,
	|	ВТ_ОписаниеДокумента.Резерв КАК Резерв,
	|	ВТ_ОписаниеДокумента.Ссылка КАК Ссылка,
	|	ВТ_ОписаниеДокумента.СтатьяФинансирования КАК СтатьяФинансирования
	|ИЗ
	|	ВТ_ОписаниеДокумента КАК ВТ_ОписаниеДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОценочныеОбязательстваПоСотрудникам.Ссылка КАК Ссылка,
	|	ОценочныеОбязательстваПоСотрудникам.НомерСтроки КАК НомерСтроки,
	|	ОценочныеОбязательстваПоСотрудникам.Сотрудник КАК Сотрудник,
	|	-ОценочныеОбязательстваПоСотрудникам.СуммаРезерва КАК СуммаРезерва,
	|	-ОценочныеОбязательстваПоСотрудникам.СуммаРезерваНУ КАК СуммаРезерваНУ,
	|	-ОценочныеОбязательстваПоСотрудникам.СуммаРезерваСтраховыхВзносов КАК СуммаРезерваСтраховыхВзносов,
	|	-ОценочныеОбязательстваПоСотрудникам.СуммаРезерваСтраховыхВзносовНУ КАК СуммаРезерваСтраховыхВзносовНУ,
	|	-ОценочныеОбязательстваПоСотрудникам.СуммаРезерваФССНесчастныеСлучаи КАК СуммаРезерваФССНесчастныеСлучаи,
	|	-ОценочныеОбязательстваПоСотрудникам.СуммаРезерваФССНесчастныеСлучаиНУ КАК СуммаРезерваФССНесчастныеСлучаиНУ,
	|	ВТ_ОписаниеДокумента.Резерв КАК Резерв,
	|	ВТ_ОписаниеДокумента.СтатьяФинансирования КАК СтатьяФинансирования
	|ИЗ
	|	Документ.ПереносРезервовМеждуСтатьямиФинансирования.ОценочныеОбязательстваПоСотрудникам КАК ОценочныеОбязательстваПоСотрудникам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОписаниеДокумента КАК ВТ_ОписаниеДокумента
	|		ПО ОценочныеОбязательстваПоСотрудникам.Ссылка = ВТ_ОписаниеДокумента.Ссылка
	|ГДЕ
	|	ОценочныеОбязательстваПоСотрудникам.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_ОписаниеДокумента.Ссылка
	|			ИЗ
	|				ВТ_ОписаниеДокумента)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОписаниеДокумента.Ссылка КАК Ссылка,
	|	СтатьиФинансирования.СтатьяФинансирования КАК СтатьяФинансирования,
	|	СтатьиФинансирования.ПроцентРаспределения КАК ПроцентРаспределения
	|ИЗ
	|	Документ.ПереносРезервовМеждуСтатьямиФинансирования.СтатьиФинансирования КАК СтатьиФинансирования
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОписаниеДокумента КАК ВТ_ОписаниеДокумента
	|		ПО СтатьиФинансирования.Ссылка = ВТ_ОписаниеДокумента.Ссылка
	|ГДЕ
	|	СтатьиФинансирования.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_ОписаниеДокумента.Ссылка
	|			ИЗ
	|				ВТ_ОписаниеДокумента)";
	
	Результат = Запрос.ВыполнитьПакет();
	
	ОписаниеДокумента = Результат[1].Выгрузить();
	ОценочныеОбязательстваПоСотрудникам = Результат[2].Выгрузить();
	СтатьиФинансирования = Результат[3].Выгрузить();
	
	СписокКолонок = "СуммаРезерва,СуммаРезерваНУ,СуммаРезерваСтраховыхВзносов,СуммаРезерваСтраховыхВзносовНУ,СуммаРезерваФССНесчастныеСлучаи,СуммаРезерваФССНесчастныеСлучаиНУ";
	МассивИменКолонок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СписокКолонок, , Истина, Истина);
	
	МассивКоэффициентов = Новый Массив;
	Для Каждого СтрокаТаблицы Из СтатьиФинансирования Цикл
		МассивКоэффициентов.Добавить(СтрокаТаблицы.ПроцентРаспределения);
	КонецЦикла;
	
	ОценочныеОбязательстваПоСотрудникамВрем = ОценочныеОбязательстваПоСотрудникам.СкопироватьКолонки();
	Для Каждого СтрокаТаблицы Из ОценочныеОбязательстваПоСотрудникам Цикл
		Для Каждого ИмяПоказателя Из МассивИменКолонок Цикл
			МассивНовыхСумм = РезервыПоОплатеТруда.РаспределитьПропорционально(СтрокаТаблицы[ИмяПоказателя], МассивКоэффициентов);
			Если МассивНовыхСумм = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ИндексСтроки = 0;
			КоличествоСтрок = МассивНовыхСумм.Количество();
			Пока ИндексСтроки < КоличествоСтрок Цикл
				НоваяСтрока = ОценочныеОбязательстваПоСотрудникамВрем.Добавить();
				НоваяСтрока.Сотрудник = СтрокаТаблицы.Сотрудник;
				НоваяСтрока.Резерв = СтрокаТаблицы.Резерв;
				НоваяСтрока.СтатьяФинансирования = СтатьиФинансирования[ИндексСтроки].СтатьяФинансирования;
				НоваяСтрока[ИмяПоказателя] = - МассивНовыхСумм[ИндексСтроки];
				ИндексСтроки = ИндексСтроки + 1;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	ОценочныеОбязательстваПоСотрудникамВрем.Свернуть("Резерв, Сотрудник, СтатьяФинансирования", СписокКолонок);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ОценочныеОбязательстваПоСотрудникамВрем, ОценочныеОбязательстваПоСотрудникам);
	
	ДанныеДляОтражения.ОценочныеОбязательстваПоСотрудникам = ОценочныеОбязательстваПоСотрудникам;
	ДанныеДляОтражения.ОценочныеОбязательства = ОценочныеОбязательстваПоСотрудникам;
	
КонецПроцедуры

Функция СотрудникиПоШапкеДокумента(СтруктураПараметров)
	
	ПараметрыПолучения = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолучения.Организация = СтруктураПараметров.Организация;
	ПараметрыПолучения.КадровыеДанные = "Организация,Подразделение";
	Если ЗначениеЗаполнено(СтруктураПараметров.Подразделение) Тогда
		ПараметрыПолучения.Подразделение = СтруктураПараметров.Подразделение;
	КонецЕсли;
	ПараметрыПолучения.НачалоПериода = СтруктураПараметров.ПериодРегистрации;
	ПараметрыПолучения.ОкончаниеПериода = КонецМесяца(СтруктураПараметров.ПериодРегистрации);
	
	КадровыеДанные = КадровыйУчет.СотрудникиОрганизации(Истина, ПараметрыПолучения);
	Если ЗначениеЗаполнено(СтруктураПараметров.Подразделение) Тогда
		КадровыеДанныеВременная = КадровыеДанные.Скопировать(Новый Структура("Подразделение", СтруктураПараметров.Подразделение));
		Для Каждого СтрокаТаблицы Из КадровыеДанные Цикл
			Если СтрокаТаблицы.Организация <> СтруктураПараметров.Организация Тогда
				ЗаполнитьЗначенияСвойств(КадровыеДанныеВременная.Добавить(), СтрокаТаблицы);
			КонецЕсли;
		КонецЦикла;
		КадровыеДанные = КадровыеДанныеВременная.Скопировать();
	КонецЕсли;
	
	Сотрудники = ОбщегоНазначения.ВыгрузитьКолонку(КадровыеДанные, "Сотрудник", Истина);
	
	Возврат Сотрудники;
	
КонецФункции

Функция РезервыСотрудников(СтруктураПараметров) Экспорт
	
	НачалоПериода = НачалоМесяца(СтруктураПараметров.ПериодРегистрации);
	КонецПериода = Новый Граница(Новый МоментВремени(КонецМесяца(СтруктураПараметров.ПериодРегистрации)),ВидГраницы.Включая);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("Организация", СтруктураПараметров.Организация);
	Запрос.УстановитьПараметр("Резерв", СтруктураПараметров.Резерв);
	Запрос.УстановитьПараметр("СтатьяФинансированияИсточник", СтруктураПараметров.СтатьяФинансированияИсточник);
	Запрос.УстановитьПараметр("Сотрудники", СтруктураПараметров.Сотрудники);
	Запрос.УстановитьПараметр("Ссылка", СтруктураПараметров.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОценочныеОбязательстваПоСотрудникамОстатки.Сотрудник КАК Сотрудник,
	|	ОценочныеОбязательстваПоСотрудникамОстатки.СуммаРезерваОстаток КАК СуммаРезерва,
	|	ОценочныеОбязательстваПоСотрудникамОстатки.СуммаРезерваНУОстаток КАК СуммаРезерваНУ,
	|	ОценочныеОбязательстваПоСотрудникамОстатки.СуммаРезерваСтраховыхВзносовОстаток КАК СуммаРезерваСтраховыхВзносов,
	|	ОценочныеОбязательстваПоСотрудникамОстатки.СуммаРезерваСтраховыхВзносовНУОстаток КАК СуммаРезерваСтраховыхВзносовНУ,
	|	ОценочныеОбязательстваПоСотрудникамОстатки.СуммаРезерваФССНесчастныеСлучаиОстаток КАК СуммаРезерваФССНесчастныеСлучаи,
	|	ОценочныеОбязательстваПоСотрудникамОстатки.СуммаРезерваФССНесчастныеСлучаиНУОстаток КАК СуммаРезерваФССНесчастныеСлучаиНУ
	|ПОМЕСТИТЬ ВТ_ОстаткиОбороты
	|ИЗ
	|	РегистрНакопления.ОценочныеОбязательстваПоСотрудникам.Остатки(
	|			&КонецПериода,
	|			Организация = &Организация
	|				И Резерв = &Резерв
	|				И СтатьяФинансирования = &СтатьяФинансированияИсточник
	|				И Сотрудник В (&Сотрудники)) КАК ОценочныеОбязательстваПоСотрудникамОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОценочныеОбязательстваПоСотрудникамОбороты.Сотрудник,
	|	-ОценочныеОбязательстваПоСотрудникамОбороты.СуммаРезерваОборот,
	|	-ОценочныеОбязательстваПоСотрудникамОбороты.СуммаРезерваНУОборот,
	|	-ОценочныеОбязательстваПоСотрудникамОбороты.СуммаРезерваСтраховыхВзносовОборот,
	|	-ОценочныеОбязательстваПоСотрудникамОбороты.СуммаРезерваСтраховыхВзносовНУОборот,
	|	-ОценочныеОбязательстваПоСотрудникамОбороты.СуммаРезерваФССНесчастныеСлучаиОборот,
	|	-ОценочныеОбязательстваПоСотрудникамОбороты.СуммаРезерваФССНесчастныеСлучаиНУОборот
	|ИЗ
	|	РегистрНакопления.ОценочныеОбязательстваПоСотрудникам.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Организация = &Организация
	|				И Резерв = &Резерв
	|				И СтатьяФинансирования = &СтатьяФинансированияИсточник
	|				И Сотрудник В (&Сотрудники)) КАК ОценочныеОбязательстваПоСотрудникамОбороты
	|ГДЕ
	|	ОценочныеОбязательстваПоСотрудникамОбороты.Регистратор = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиОбороты.Сотрудник КАК Сотрудник,
	|	СУММА(ВТ_ОстаткиОбороты.СуммаРезерва) КАК СуммаРезерва,
	|	СУММА(ВТ_ОстаткиОбороты.СуммаРезерваНУ) КАК СуммаРезерваНУ,
	|	СУММА(ВТ_ОстаткиОбороты.СуммаРезерваСтраховыхВзносов) КАК СуммаРезерваСтраховыхВзносов,
	|	СУММА(ВТ_ОстаткиОбороты.СуммаРезерваСтраховыхВзносовНУ) КАК СуммаРезерваСтраховыхВзносовНУ,
	|	СУММА(ВТ_ОстаткиОбороты.СуммаРезерваФССНесчастныеСлучаи) КАК СуммаРезерваФССНесчастныеСлучаи,
	|	СУММА(ВТ_ОстаткиОбороты.СуммаРезерваФССНесчастныеСлучаиНУ) КАК СуммаРезерваФССНесчастныеСлучаиНУ
	|ИЗ
	|	ВТ_ОстаткиОбороты КАК ВТ_ОстаткиОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОстаткиОбороты.Сотрудник";
	
	Если СтруктураПараметров.Сотрудники = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Сотрудник В (&Сотрудники)", "");
	КонецЕсли;
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
